'''
13- เขียนโปรแกรมให้นับว่าเดือนที่ผู้ใช้กรอกเข้ามามีกี่วัน เช่น มกราคม 2024 จะได้ output เป็น 31 
วันเป็นต้น ส่วนเดือนกุมภาพันธ์หากหารด้วย 4 ลงตัว ให้มีจำนวนวันเป็น 29 และหากหารไม่ลงตัวให้มี 28 วัน
'''

day_31 = ['มกราคม','มีนาคม','พฤษภาคม','กรกฎาคม','สิงหาคม','ตุลาคม','ธันวาคม']
day_30 = ['เมษายน','มิถุนายน','กันยายน','พฤศจิกายน']

text_input = input('กรุณากรอกเดือนและปี เช่น "มกราคม 2024" : ')
month,year = text_input.split(' ')
day_output = None

if month in day_31:
    day_output = 31
elif month in day_30:
    day_output = 30
elif month == 'กุมภาพันธ์':
    if int(year) % 4 == 0:
        day_output = 29
    else:
        day_output = 28

print('เดือน: {} ปี ค.ศ. {} มี {} วัน'.format(month,year, day_output))