'''
15- โปรแกรมคำนวณค่าแท็กซี่ โดยกรอกจำนวนระยะทางเข้าไป

ระยะทาง 1 กิโลเมตรแรก 35.00 บาท
-ระยะทางเกินกว่า 1 กิโลเมตรถึงกิโลเมตรที่ 10 กิโลเมตรละ 6.50 บาท
-ระยะทางเกินกว่า 10 กิโลเมตรถึงกิโลเมตรที่ 20 กิโลเมตรละ 7.00 บาท
-ระยะทางเกินกว่า 20 กิโลเมตรถึงกิโลเมตรที่ 40 กิโลเมตรละ 8.00 บาท
-ระยะทางเกินกว่า 40 กิโลเมตรถึงกิโลเมตรที่ 60 กิโลเมตรละ 8.50 บาท
-ระยะทางเกินกว่า 60 กิโลเมตรถึงกิโลเมตรที่ 80 กิโลเมตรละ 9.00 บาท
-ระยะทางเกินกว่า 80 กิโลเมตรขึ้นไป กิโลเมตรละ 10.50 บาท
'''

distance = float(input('ระยะทาง (ก.ม.): '))

fare = 0

if distance <= 1:
    fare = 35
elif distance > 1 and distance <= 10:
    fare = 35 + ((distance - 1) * 6.5)
elif distance > 10 and distance <= 20:
    fare = 35 + (9*6.5)+((distance - 10) * 7)
elif distance > 20 and distance <= 40:
    fare = 35 + (9*6.5)+(10*7)+((distance - 20) * 8)
elif distance > 40 and distance <= 60:
    fare = 35 + (9*6.5)+(10*7)+(20 * 8)+((distance - 40) * 8.5)
elif distance > 60 and distance <= 80:
    fare = 35 + (9*6.5)+(10*7)+(20 * 8)+(20 * 8.5)+((distance - 60) * 9)
else:
    fare = 35 + (9*6.5)+(10*7)+(20 * 8)+(20 * 8.5)+(20 * 9)+((distance - 80) * 10.5)

print('เดินทางไป: {:,.2f} ก.ม. ค่าแท็กซี่: {:.2f} บาท'.format(distance,fare))