'''
17- ให้เขียนโปรแกรมที่รับอายุและประสบการณ์การทำงานจากผู้ใช้ แล้วตรวจสอบว่าผู้ใช้มีคุณสมบัติสมัครงานตำแหน่งนี้หรือไม่ โดยมีเงื่อนไขว่า:

หากอายุอยู่ระหว่าง 25 ถึง 40 ปี และมีประสบการณ์การทำงานมากกว่า 3 ปี ผู้ใช้มีคุณสมบัติสมัครงาน
นอกเหนือจากนี้ ผู้ใช้ไม่มีคุณสมบัติสมัครงาน
โปรแกรมจะแสดงผลว่า "มีคุณสมบัติสมัครงาน" หรือ "ไม่มีคุณสมบัติสมัครงาน"
'''

age = int(input('กรุณากรอกอายุ (ปี): '))
experience = int(input('ประสบการณ์การทำงาน (ปี): '))

if age >= 25 and age <= 40 and experience >= 3:
    print('มีคุณสมบัติสมัครงาน')
else:
    print('ไม่มีคุณสมบัติสมัครงาน')