'''
18- ให้เขียนโปรแกรมที่รับคะแนนสอบ (เต็ม 100) จากผู้ใช้แล้วทำการประเมินเกรดตามเงื่อนไขต่อไปนี้:
-คะแนนตั้งแต่ 80 ขึ้นไป ให้เกรด A
-คะแนนตั้งแต่ 70 ขึ้นไป แต่ต่ำกว่า 80 ให้เกรด B
-คะแนนตั้งแต่ 60 ขึ้นไป แต่ต่ำกว่า 70 ให้เกรด C
-คะแนนตั้งแต่ 50 ขึ้นไป แต่ต่ำกว่า 60 ให้เกรด D
-คะแนนต่ำกว่า 50 ให้เกรด F
'''

exam_score = int(input('กรุณากรอกคะแนนสอบ: '))

if exam_score >= 80:
    print('คุณได้เกรด A')
elif exam_score >= 70:
    print('คุณได้เกรด B')
elif exam_score >= 60:
    print('คุณได้เกรด C')
elif exam_score >= 50:
    print('คุณได้เกรด D')
else:
    print('คุณได้เกรด F')