'''
19- บริษัทมีนโยบายให้ค่าคอมมิชชั่นพนักงานขายตามยอดขายที่ทำได้ โดยมีเงื่อนไขดังนี้:
-หากยอดขายน้อยกว่า 10,000 บาท ค่าคอมมิชชั่นเป็น 0%
-หากยอดขายอยู่ระหว่าง 10,000 ถึง 50,000 บาท ค่าคอมมิชชั่นเป็น 5%
-หากยอดขายเกิน 50,000 บาท ค่าคอมมิชชั่นเป็น 10%
-ให้เขียนโปรแกรมที่รับยอดขายจากผู้ใช้แล้วคำนวณค่าคอมมิชชั่นที่พนักงานขายจะได้รับ
'''
sales = int(input('กรอกยอดขาย: '))
com = 0

if sales > 50000:
    com = 10
elif sales > 10000:
    com = 5
else:
    com = 0

cal = sales * (com/100)

print('คุณได้ค่าคอมมิชชั่น ({:,d}%): {:,.0f} บาท จากยอดขายทั้งหมด: {:,d} บาท'.format(com,cal,sales))

