'''
20- ให้เขียนโปรแกรมที่คำนวณค่าส่งสินค้าตามน้ำหนัก โดยมีเงื่อนไขดังนี้:
-น้ำหนักไม่เกิน 1 กิโลกรัม ค่าส่ง 30 บาท
-น้ำหนักมากกว่า 1 กิโลกรัม แต่ไม่เกิน 5 กิโลกรัม ค่าส่ง 50 บาท
-น้ำหนักมากกว่า 5 กิโลกรัม แต่ไม่เกิน 10 กิโลกรัม ค่าส่ง 100 บาท
-น้ำหนักมากกว่า 10 กิโลกรัม ค่าส่ง 200 บาท
'''

weight = float(input('กรุณากรอกน้ำหนัก: '))
shipping = 0
if weight >= 10:
    shipping = 200
elif weight >= 5:
    shipping = 100
elif weight >= 1:
    shipping = 50
else:
    shipping = 30

print(f'ค่าส่งของหนัก {weight} กิโลกรัม เท่ากับ {shipping} บาท')