"""
3-เขียนโปรแกรมเพื่อจัดการสต็อกสินค้าในคลัง โดยรับจำนวนสินค้าที่มีอยู่ปัจจุบันและจำนวนสินค้าที่ขายได้ในแต่ละวัน 
จากนั้นโปรแกรมจะ:

-คำนวณยอดสินค้าคงเหลือหลังการขายในแต่ละวัน
-ถ้ายอดสินค้าคงเหลือต่ำกว่า 10 ชิ้น ให้เตือนผู้ใช้ว่า "สินค้าคงเหลือน้อย ควรสั่งซื้อเพิ่ม"
-ถ้าสินค้าหมดสต็อก ให้แสดงข้อความ "สินค้าหมด กรุณาสั่งซื้อ"
"""

current_stock = int(input('จำนวนสินค้าปัจจุบัน: '))
sold = int(input('จำนวนสินค้าที่ขายได้: '))

remaining = current_stock - sold

if remaining < 10 and remaining != 0:
    print(f'สินค้าคงเหลือ: {remaining} ชิ้น')
    print('สินค้าคงเหลือน้อย ควรสั่งซื้อเพิ่ม')
elif remaining == 0:
    print('สินค้าหมด กรุณาสั่งซื้อ')
else:
    pass
