"""
8-เขียนโปรแกรมที่คำนวณค่าน้ำประปา โดยใช้การคิดอัตราค่าน้ำแบบก้าวหน้า เช่น 
จำนวนหน่วยที่ใช้ตั้งแต่ 1-10 หน่วย คิดราคา 5 บาทต่อหน่วย, 11-20 หน่วย คิดราคา 7 บาทต่อหน่วย 
และหน่วยที่เกิน 20 คิดราคา 10 บาทต่อหน่วย โดยรับจำนวนหน่วยของน้ำประปา
"""

water_unit = int(input('กรุณากรอกจำนวนหน่วยของน้ำประปา: '))

if water_unit <= 10:
    rate = 5
    cal = water_unit * rate
    print('คุณต้องจ่ายค่าน้ำประปาทั้งหมด: {} บาท ({} หน่วย)'.format(cal,water_unit))
elif water_unit <= 20:
    rate5 = 5
    rate7 = 7
    cal = (10 * rate5) + ((water_unit - 10)*rate7)
    print('คุณต้องจ่ายค่าน้ำประปาทั้งหมด: {} บาท ({} หน่วย)'.format(cal,water_unit))
else:
    rate5 = 5
    rate7 = 7
    rate10 = 10
    cal = (10 * rate5) + (10 *rate7) + ((water_unit - 20)*rate10)
    print('คุณต้องจ่ายค่าน้ำประปาทั้งหมด: {} บาท ({} หน่วย)'.format(cal,water_unit))

